debug_request.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
               xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
               xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    
    <GetLegislationByRequestNumber xmlns="http://WSLWebServices.leg.wa.gov/">
      <biennium>2025-26</biennium>
      <requestNumber>25-0001</requestNumber>
    </GetLegislationByRequestNumber>
  </soap:Body>
</soap:Envelope>